package com.eussi.ch00_preface;

/**
 * @author wangxueming
 * @create 2019-10-16 23:54
 * @description
 */
public class Preface {
    /**
     * 数据结构是指数据在计算机存储空间中（或磁盘中）的安排方式
     *      算法是指软件程序用来操作这些结构中的数据的过程
     *
     * 几乎所有的计算机程序都使用数据结构和算法，即使最简单的程序也不例外比如设想一个打
     * 印地址标签的程序，这个程序使用一个数组来存储地址，并且使用一个简单的for循环来遍历数组,
     * 打印每一个地址。
     *
     * 在上面例子中的数组就是一个数据结构，用for循环来顺序访问该数组，这就构造了一个简单
     * 的算法。对于一个仅有少量数据的简单程序来说，上述的这种方法已经足够了。但是如果用程序来
     * 处理中等规模以上的数据或解决那些不太平常的问题时，就需要用一些更加复杂的技术来应付它
     * 们。仅仅知道诸如Java或C++等计算机语言的语法是远远不够的。
     *
     *
     *
     */
}
